[
  {
    "alt": "aeropress machine",
    "date": "2025-05-28",
    "quick_title": "Aeropress",
    "text": "Aeropress Review",
    "location": "London, UK",
    "type": "brewing",
    "ranking": 5,
    "title": "Aeropress Review",
    "markdownText": "The famous AeroPress, conceived by Adam Adler in 2005, since becoming one of the most popular brewing methods across the world. If you've never heard of this thing before, get ready for a life-changing experience. For those of you who only have the attention span to read this far down, I absolutely recommend this to anyone looking at brewing coffee at home.\n\nSo how do we use this thing? Pop a filter paper into the basket, attach it to the main body, grind your beans (or use pre-ground beans - we don't mind here), pour them into the AeroPress, fill with water, and press away! Fantastic coffee in under 2 minutes without any of the gritty sludge and long wait associated with a cafetière. \n\nIf you're like me and prefer a strong cup, the AeroPress is going to beat out any cafetière or drip coffee out there - both of which have their merits. Now, I will admit that I have rarely tried coffee brewed with either a Moka pot or pour-over; however, I can clean my AeroPress in 20 seconds under the tap, quicker than any alternative unless you're the Flash.\n\nSo we have strong, fast, and tasty coffee in just a couple of minutes. Sounds like a poor man's espresso machine, right? To some extent - yes. This thing cost me about £25 compared to £100 for even the cheapest espresso machine on the market. I'll take the poor man's option any day...\n\nLet's keep things sensible; this won't give you an espresso shot like a fancy electric machine will, and you're making one cup at a time. Good luck serving a coffee to a room full of people with one of these. However, for a quick, tasty cup for myself in the morning, it is perfect. Machine-washable, compact, and cheap. \n\nYou might have heard the expression \"skill floor\" and \"skill ceiling\" before. If not, just understand that you do not need experience in coffee to be effective at this thing. If you think that means there is no room to experiment and flex your brewing skills, take a look at any one of the 60 national AeroPress competitions each year...\n\nA truly brilliant tool. At its price point I would highly recommend adding it to your brewing arsenal. ",
    "jpgFileName": "Articles/aeropress_0.webp",
    "uuid": "3746317213"
  },
  {
    "alt": "dunkin donuts storefront in Birmingham",
    "date": "2025-05-29",
    "quick_title": "Dunkin Donuts",
    "text": "Flat White from Dunkin Donuts",
    "location": "Birmingham, UK",
    "type": "coffee shop",
    "ranking": 0,
    "title": "Dunkin Donuts Flat White Review",
    "markdownText": "Alright, settle in, because we need to talk about the 'flat white' from Dunkin' Donuts. And I use those inverted commas with the kind of disdain usually reserved for a particularly egregious tax loophole or a politician's apology.\n\nNow, I approach coffee with a certain... reverence. It's a craft. A science. A delicate dance between bean, water, and milk. What I received from Dunkin' was less a dance, and more a clumsy stumble in the dark, ending with a face-plant into a puddle of lukewarm regret.\n\nLet's start with the name itself: \"Flat White.\" A bold claim. A promise, even. The flat white, in its purest form, is a thing of beauty – velvety milk, perfectly integrated, a subtle sweetness, and a robust espresso backbone. What Dunkin' delivered was, frankly, an insult to the very concept.\n\nThe visual? Imagine if a cloud had a bad day, then got run over by a truck, and then someone tried to scoop it into a cup with a rusty shovel. There was no 'flatness' to speak of, unless you count the flatness of my soul after the first sip. It was a chaotic, bubbly mess, like a toddler's bathwater after they've discovered the joy of splashing. The colour was less 'rich, creamy off-white' and more 'beige despair.'\n\nAnd the taste. Oh, the taste. It was a lukewarm, watery whisper of what coffee might have been, had it not been tragically murdered before it reached my lips. The espresso, if you can call it that, was utterly lost, drowned in a sea of what I can only assume was milk that had given up on life. There was no texture, no body, no discernible flavour beyond a vague, sugary emptiness. It was the kind of beverage that makes you question your life choices, your priorities, and whether humanity truly deserves to continue.\n\nIn summary, if you're looking for a flat white, go literally anywhere else. Or better yet, just drink water. It'll be more satisfying, and significantly less offensive. This wasn't a flat white; it was a crime against coffee, and frankly, I'm not sure I'll ever recover.",
    "jpgFileName": "Articles/dunkin_donuts_birmingham_0.png",
    "uuid": "9697354961"
  },
  {
    "alt": "rave coffee bag",
    "date": "2025-05-23",
    "quick_title": "Rave Wahana Estate",
    "text": "Medium roast Indonesian beans",
    "location": "Indonesia",
    "type": "beans",
    "ranking": 5,
    "title": "Rave Wahana Estate Coffee Review",
    "markdownText": "Alright, let’s get into it.\n\nWahana Estate No.191 walks in with swagger — it’s from Indonesia, it’s estate-grown, it probably knows a thing or two about volcanic soil and artisanal fermentation. It wants to be the hero your morning deserves… but let’s be honest, it’s not quite Bruce Wayne — it’s more like that well-dressed guy in the boardroom who’s technically competent but never gets the girl.\n\nThe aroma? Earthy, woody, slightly mysterious — like the jungle floor after a tropical rain. Promising stuff. You lean in. You sip. And then… meh.\n\nIt’s interesting — yes. Complex? Arguably. But balanced? That’s where things start to wobble.\n\nWhat’s good:\nThat deep, brooding base — classic Indonesian body, syrupy and low-acid.\n\nNotes of dried fruit, cedar, maybe even a hint of tobacco — like it’s been aged in a wise old library somewhere near Lake Toba.\n\nBut here’s the rub:\nIt lacks spark. That flavour crescendo you’re hoping for? It never quite arrives. The finish? A little flat. Like a monologue that trails off mid-sentence.\n\nIf you don’t dial in the brew perfectly, it can turn muddy, even murky. The kind of cup that says \"rustic\" but ends up just tasting confused.\n\nLet’s not be unfair — Wahana No.191 has merit. It’s just not the leading role. It’s the gritty side character with potential that never quite lands the punchline. Worth trying? Absolutely. Worth raving about? Maybe not without a bit of Batcave-level brew tuning.",
    "jpgFileName": "Articles/rave_indonesia_no293.jpg",
    "uuid": "2181241943"
  },
  {
    "alt": "rave coffee bag",
    "date": "2025-06-15",
    "quick_title": "Rave Asali AB",
    "text": "Dark roast Kenyan beans",
    "location": "Nyeri County, Kenya",
    "type": "beans",
    "ranking": 5,
    "title": "Rave Kenya Asali AB Coffee Review",
    "markdownText": "I’ve been a big fan of Rave since signing up to their subscription in early May. I'm now on my third bag, and this might just be my favourite yet. I generally find myself leaning towards a lighter roast these days, but this dark Kenyan AB Asali may have just flipped the script. \n\nWe have here a speciality grade coffee from Nyeri County in Kenya. I’ll preface this review with the fact that I am a devout, AeroPressed black coffee drinker at home - sorry to any milk fans out there.\n\nThe first cup I tasted in Tuesday's early hours may have been my best home brew yet. Having just finished a sweet breakfast, following up with this coffee was a genius move (if you can pair it with a pastry or even some cereal, you’re in for a treat). We’ve got a full-bodied, caramelly profile with this one. As someone who’s generally tasted South American beans, I will definitely be trying some more from Africa in the near future. \n\nIn all fairness, as much as I loved this coffee, you are paying a pretty penny to get hold of it at £8.95 per 250g bag. As an amateur coffee drinker, I would find it difficult to tell you the complex distinctions between a similar coffee that is perhaps a few pounds cheaper. But let's be honest, at the very least you’re getting one hell of a delicious placebo effect, and at worst, a great-tasting bag of coffee. \n\nThis gets a full 5-star review. For helping reignite my enthusiasm for darker roasted coffee and a delicious profile, I would highly recommend picking this up.\n\n\n\n\n\n",
    "jpgFileName": "Articles/rave_kenya_no301.jpg",
    "uuid": "1958682846"
  },
  {
    "alt": "rave coffee bag",
    "date": "2025-05-02",
    "quick_title": "Rave Mbili Twiga",
    "text": "Dark roast Tanzanian beans",
    "location": "Tanzania",
    "type": "beans",
    "ranking": 4,
    "title": "Rave Mbili Twiga Coffee Review",
    "markdownText": "Let me tell you something: I’ve tasted a lot of coffee. Some slap you in the face like Batman interrogating a goon. Others whisper sweet nothings and leave you wondering if you even drank anything. Rave Mbili Twiga Nº 291? This stuff waltzes in wearing a three-piece suit, gives you a smouldering stare, and then—bam!—hits your taste buds with a monologue of flavour.\n\nFirst sip: prune—but not your grandma’s prunes. I’m talking rich, velvety, handsome prunes. The kind that wear a leather jacket and read Nietzsche.\n\nThen there’s black tea. Not the bag-in-a-mug, sad-office-breakroom type. No, this is James Bond at high tea in Dar es Salaam, pinky raised, enemies watching.\n\nAnd finally: treacle. Dark, mysterious, and so seductive it probably has a secret identity.\n\nThe roast? Smooth. Confident. Balanced like a Nolan film plotline—complex, but not trying too hard to be clever. “Korongo” means flamingo, and somehow this coffee does strut like a bird that knows it’s pretty, but has also read Hemingway.\n\nIn summary: this isn’t your average cup. This is a mood, a moment, a supporting character in the biopic of your morning. And at £8.95, it’s cheaper than therapy and twice as enlightening.",
    "jpgFileName": "Articles/rave_tanzania_no291.jpg",
    "uuid": "4163119785"
  }
]