[
  {
    "alt": "aeropress machine",
    "date": "2025-05-28",
    "quick_title": "Aeropress",
    "text": "Aeropress Review",
    "location": "London, UK",
    "type": "brewing",
    "ranking": 5,
    "title": "Aeropress Review",
    "markdownText": "Ah, the AeroPress glass edition — now that’s what I call brewing with style! If Steve McManaman traded the football pitch for the coffee counter, I’m sure he’d say this:\n\n\"Mate, this AeroPress is like that perfect pass — smooth, slick, and right on target every single time. You pop your grounds in, give it a good press, and bam! — you’ve got a coffee so clean and sharp, it could slice through any sleepy morning like I used to slice through defenders on the pitch. \n\nIt’s quick, it’s efficient, and it never lets you down — kinda like me back in the day! Plus, the glass gives it that classy touch — none of that plastic business. It’s like drinking from a trophy cup, but filled with liquid gold. Five stars, no doubt. If coffee was football, this AeroPress would be the Man of the Match!\"",
    "jpgFileName": "Articles/aeropress_0.webp",
    "uuid": "3746317213"
  },
  {
    "alt": "dunkin donuts storefront in Birmingham",
    "date": "2025-05-29",
    "quick_title": "Dunkin Donuts",
    "text": "Flat White from Dunkin Donuts",
    "location": "Birmingham, UK",
    "type": "coffee shop",
    "ranking": 0,
    "title": "Dunkin Donuts Flat White Review",
    "markdownText": "Alright, settle in, because we need to talk about the 'flat white' from Dunkin' Donuts. And I use those inverted commas with the kind of disdain usually reserved for a particularly egregious tax loophole or a politician's apology.\n\nNow, I approach coffee with a certain... reverence. It's a craft. A science. A delicate dance between bean, water, and milk. What I received from Dunkin' was less a dance, and more a clumsy stumble in the dark, ending with a face-plant into a puddle of lukewarm regret.\n\nLet's start with the name itself: \"Flat White.\" A bold claim. A promise, even. The flat white, in its purest form, is a thing of beauty – velvety milk, perfectly integrated, a subtle sweetness, and a robust espresso backbone. What Dunkin' delivered was, frankly, an insult to the very concept.\n\nThe visual? Imagine if a cloud had a bad day, then got run over by a truck, and then someone tried to scoop it into a cup with a rusty shovel. There was no 'flatness' to speak of, unless you count the flatness of my soul after the first sip. It was a chaotic, bubbly mess, like a toddler's bathwater after they've discovered the joy of splashing. The colour was less 'rich, creamy off-white' and more 'beige despair.'\n\nAnd the taste. Oh, the taste. It was a lukewarm, watery whisper of what coffee might have been, had it not been tragically murdered before it reached my lips. The espresso, if you can call it that, was utterly lost, drowned in a sea of what I can only assume was milk that had given up on life. There was no texture, no body, no discernible flavour beyond a vague, sugary emptiness. It was the kind of beverage that makes you question your life choices, your priorities, and whether humanity truly deserves to continue.\n\nIn summary, if you're looking for a flat white, go literally anywhere else. Or better yet, just drink water. It'll be more satisfying, and significantly less offensive. This wasn't a flat white; it was a crime against coffee, and frankly, I'm not sure I'll ever recover.",
    "jpgFileName": "Articles/dunkin_donuts_birmingham_0.png",
    "uuid": "9697354961"
  },
  {
    "alt": "rave coffee bag",
    "date": "2025-03-05",
    "quick_title": "Rave China Donka",
    "text": "Medium roast Chinese beans",
    "location": "China",
    "type": "beans",
    "ranking": 1,
    "title": "Rave China Donka Coffee Review",
    "markdownText": "Let’s not beat around the Chemex — China Dongka Nº 261 isn’t just a coffee, it’s an experience. The kind of brew that walks into your kitchen at 7am, adjusts its cufflinks, and says: \"You look like you need saving, sunshine.\"\n\nFirst off, yes — China. And if that surprised you, welcome to the future. Rave’s partnership with Indochina and Yunnan Coffee Traders has unlocked a flavour profile so elegant it practically bowed before entering my mug.\n\nThe aromatics? Like tea, but if tea had dreams of being a jazz musician and finally made it to the big stage. Delicate, floral, and slightly mysterious — like that one girl at the bar who reads Murakami and makes eye contact once.\n\nThen come the flavours:\n\nCitrus – not the screechy, sour kind. This is orchestral citrus, smooth and purposeful, like a lemon that went to finishing school.\n\nAlmond – subtle, creamy, like a background character that suddenly wins an Oscar.\n\nBrown sugar – rich and cozy, but not clingy. The kind of sweetness that calls you “darling” and means it.\n\nThis coffee is vibrant, clean, and sweet—kind of like if Christian Bale’s Bruce Wayne took a vacation to Yunnan, discovered enlightenment, and came back with a Chemex instead of a Batmobile.\n\nBottom line: Dongka Nº 281 doesn’t need to shout. It just shows up, takes your hand, and calmly rewrites your idea of what Chinese coffee can be.",
    "jpgFileName": "Articles/rave_china_no261.jpg",
    "uuid": "2181241943"
  },
  {
    "alt": "rave coffee bag",
    "date": "2025-05-23",
    "quick_title": "Rave Wahana Estate",
    "text": "Medium roast Indonesian beans",
    "location": "Indonesia",
    "type": "beans",
    "ranking": 5,
    "title": "Rave Wahana Estate Coffee Review",
    "markdownText": "Alright, let’s get into it.\n\nWahana Estate No.191 walks in with swagger — it’s from Indonesia, it’s estate-grown, it probably knows a thing or two about volcanic soil and artisanal fermentation. It wants to be the hero your morning deserves… but let’s be honest, it’s not quite Bruce Wayne — it’s more like that well-dressed guy in the boardroom who’s technically competent but never gets the girl.\n\nThe aroma? Earthy, woody, slightly mysterious — like the jungle floor after a tropical rain. Promising stuff. You lean in. You sip. And then… meh.\n\nIt’s interesting — yes. Complex? Arguably. But balanced? That’s where things start to wobble.\n\nWhat’s good:\nThat deep, brooding base — classic Indonesian body, syrupy and low-acid.\n\nNotes of dried fruit, cedar, maybe even a hint of tobacco — like it’s been aged in a wise old library somewhere near Lake Toba.\n\nBut here’s the rub:\nIt lacks spark. That flavour crescendo you’re hoping for? It never quite arrives. The finish? A little flat. Like a monologue that trails off mid-sentence.\n\nIf you don’t dial in the brew perfectly, it can turn muddy, even murky. The kind of cup that says \"rustic\" but ends up just tasting confused.\n\nLet’s not be unfair — Wahana No.191 has merit. It’s just not the leading role. It’s the gritty side character with potential that never quite lands the punchline. Worth trying? Absolutely. Worth raving about? Maybe not without a bit of Batcave-level brew tuning.",
    "jpgFileName": "Articles/rave_indonesia_no293.jpg",
    "uuid": "1958682846"
  },
  {
    "alt": "rave coffee bag",
    "date": "2025-05-02",
    "quick_title": "Rave Mbili Twiga",
    "text": "Dark roast Tanzanian beans",
    "location": "Tanzania",
    "type": "beans",
    "ranking": 4,
    "title": "Rave Mbili Twiga Coffee Review",
    "markdownText": "Let me tell you something: I’ve tasted a lot of coffee. Some slap you in the face like Batman interrogating a goon. Others whisper sweet nothings and leave you wondering if you even drank anything. Rave Mbili Twiga Nº 291? This stuff waltzes in wearing a three-piece suit, gives you a smouldering stare, and then—bam!—hits your taste buds with a monologue of flavour.\n\nFirst sip: prune—but not your grandma’s prunes. I’m talking rich, velvety, handsome prunes. The kind that wear a leather jacket and read Nietzsche.\n\nThen there’s black tea. Not the bag-in-a-mug, sad-office-breakroom type. No, this is James Bond at high tea in Dar es Salaam, pinky raised, enemies watching.\n\nAnd finally: treacle. Dark, mysterious, and so seductive it probably has a secret identity.\n\nThe roast? Smooth. Confident. Balanced like a Nolan film plotline—complex, but not trying too hard to be clever. “Korongo” means flamingo, and somehow this coffee does strut like a bird that knows it’s pretty, but has also read Hemingway.\n\nIn summary: this isn’t your average cup. This is a mood, a moment, a supporting character in the biopic of your morning. And at £8.95, it’s cheaper than therapy and twice as enlightening.",
    "jpgFileName": "Articles/rave_tanzania_no291.jpg",
    "uuid": "4163119785"
  }
]